package test;

public class Sample {

	public static void main(String[] args) {

		//-----------------------------------------------------------------
		// Java基礎 「最初のプログラム」
		//-----------------------------------------------------------------

		System.out.println("Hello World.");

		//-----------------------------------------------------------------
		// Java基礎 「変数の定義と初期化」
		//-----------------------------------------------------------------

//		String value1 = "こんにちは";
//		int value2 = 100;
//		double value3 = 3.14159265358979323846;
//
//		System.out.println(value1);
//		System.out.println(value2);
//		System.out.println(value3);

		//-----------------------------------------------------------------
		// Java基礎 「変数に値を代入」
		//-----------------------------------------------------------------

//		String value1 = "こんにちは";
//		int value2 = 100;
//		double value3 = 3.14159265358979323846;
//
//		System.out.println(value1);
//		System.out.println(value2);
//		System.out.println(value3);
//
//		value1 = "ボンジュール";
//		value2 = 200;
//		value3 = 123.456;
//
//		System.out.println(value1);
//		System.out.println(value2);
//		System.out.println(value3);

		//-----------------------------------------------------------------
		// Java基礎 「数値の計算1」
		//-----------------------------------------------------------------

//		double a = 100;
//		double b = 8;
//
//		double result1 = a + b;
//		double result2 = a - b;
//		double result3 = a * b;
//		double result4 = a / b;
//		double result5 = a % b;
//
//		System.out.println(result1);
//		System.out.println(result2);
//		System.out.println(result3);
//		System.out.println(result4);
//		System.out.println(result5);

		//-----------------------------------------------------------------
		// Java基礎 「数値の計算2」
		//-----------------------------------------------------------------

//		int a = 100;
//		a = a + 5;
//		System.out.println(a);

		//-----------------------------------------------------------------
		// Java基礎 「数値の計算3」
		//-----------------------------------------------------------------

//		int a = 100;
//		a += 5;
//		System.out.println(a);

		//-----------------------------------------------------------------
		// Java基礎 「数値の計算4」
		//-----------------------------------------------------------------

//		int a = 100;
//		a++;
//		System.out.println(a);

		//-----------------------------------------------------------------
		// Java基礎 「文字列の合成1」
		//-----------------------------------------------------------------

//		String hello = "こんにちは";
//		String name = "タロウ";
//		String message = hello + name + "です";
//		System.out.println(message);

		//-----------------------------------------------------------------
		// Java基礎 「文字列の合成2」
		//-----------------------------------------------------------------

//		int year = 2021;
//		int month = 4;
//		int date = 28;
//
//		String message = "今日は" + year + "年" + month + "月" + date + "です。";
//
//		System.out.println(message);

		//-----------------------------------------------------------------
		// Java基礎 「繰り返し処理1」
		//-----------------------------------------------------------------

//		for(int i=0;i<10;i++) {
//			System.out.println("繰り返し処理:" + (i+1) + "回目");
//		}

		//-----------------------------------------------------------------
		// Java基礎 「繰り返し処理2」
		//-----------------------------------------------------------------

//		int i = 0;
//
//		while(i<10) {
//			System.out.println("繰り返し処理:" + (i+1) + "回目");
//			i++;
//		}

		//-----------------------------------------------------------------
		// Java基礎 「条件判断文」
		//-----------------------------------------------------------------

//		int score = new Random().nextInt(101);
//
//		if(score>=80) {
//			System.out.println("おめでとう！合格です！");
//		} else {
//			System.out.println("残念！不合格！");
//		}

		//-----------------------------------------------------------------
		// Java基礎 「配列」
		//-----------------------------------------------------------------

//		int[] score = new int[10];
//
//		for(int i=0;i<10;i++) {
//			score[i] = new Random().nextInt(101);
//		}
//
//		for(int i=0;i<10;i++) {
//			System.out.println("-------------------------------------------------------");
//			System.out.println((i+1) + "回目のテストは" + score[i] + "点でした。");
//		}

		//-----------------------------------------------------------------
		// Java基礎 「ArrayList」
		//-----------------------------------------------------------------

//		ArrayList<Integer> list = new ArrayList<Integer>();
//
//		for(int i=0;i<10;i++) {
//			int score = new Random().nextInt(101);
//			list.add(score);
//		}
//
//		for(int i=0;i<list.size();i++) {
//			int score = list.get(i);
//			System.out.println("-------------------------------------------------------");
//			System.out.println((i+1) + "回目のテストは" + score + "点でした。");
//		}

		//-----------------------------------------------------------------
		// Java基礎 「HashMap」
		//-----------------------------------------------------------------

//		HashMap<Integer, String> map = new HashMap<Integer, String>();
//
//		for(int i=0;i<10;i++) {
//			int key = i;
//			int score = new Random().nextInt(101);
//			String value = (i+1) + "回目のテストは" + score + "点でした。";
//			map.put(key, value);
//		}
//
//		for(int i=0;i<10;i++) {
//			String message = map.get(i);
//			System.out.println("-------------------------------------------------------");
//			System.out.println(message);
//		}

		//-----------------------------------------------------------------
		// Java基礎 「オブジェクトとは」
		//-----------------------------------------------------------------

//		Car car1 = new Car("赤");
//		Car car2 = new Car("白");
//		Car car3 = new Car("青");
//
//		car1.drive();
//		car2.drive();
//		car3.drive();
	}
}